In [3]:
import os
import pandas as pd
from pandas import Series,DataFrame

In [4]:
os.chdir("D:\Data Visulization")

In [6]:
data=pd.read_csv("Strings (1).csv")

In [8]:
data.head()

   Age    Income_M Expenses
0   10  Rs 12000/-    8,000
1   30  Rs 45000/-   21,000
2   34  Rs 39000/-   20,000
3   16   Rs 6000/-    2,000
4   19  Rs 20000/-   10,000

In [11]:
data.dtypes

Age          int64
Income_M    object
Expenses    object
dtype: object

In [12]:
data.info

<bound method DataFrame.info of     Age     Income_M Expenses
0    10   Rs 12000/-    8,000
1    30   Rs 45000/-   21,000
2    34   Rs 39000/-   20,000
3    16    Rs 6000/-    2,000
4    19   Rs 20000/-   10,000
5    45   Rs 42000/-    8,000
6    50   Rs 34000/-   10,000
7    43   Rs 56000/-   12,000
8    21   Rs 25000/-    7,000
9    78  Rs 100000/-   30,000
10   45   Rs 56000/-    6,000
11    9    Rs 2000/-      500
12   35   Rs 40000/-   12,000
13   49   Rs 27000/-   19,000
14   29   Rs 32000/-   10,000
15   96   Rs 34000/-   12,000
16   74   Rs 20000/-    5,000
17   67   Rs 23000/-    7,000
18   40   Rs 57000/-    9,000
19   53   Rs 62000/-   10,000>

In [13]:
data['Income_M']=data['Income_M'].str.replace("Rs","")

In [15]:
data.head()

   Age  Income_M Expenses
0   10   12000/-    8,000
1   30   45000/-   21,000
2   34   39000/-   20,000
3   16    6000/-    2,000
4   19   20000/-   10,000

In [16]:
data['Income_M']=data['Income_M'].str.replace("/-","")

In [17]:
data

    Age Income_M Expenses
0    10    12000    8,000
1    30    45000   21,000
2    34    39000   20,000
3    16     6000    2,000
4    19    20000   10,000
5    45    42000    8,000
6    50    34000   10,000
7    43    56000   12,000
8    21    25000    7,000
9    78   100000   30,000
10   45    56000    6,000
11    9     2000      500
12   35    40000   12,000
13   49    27000   19,000
14   29    32000   10,000
15   96    34000   12,000
16   74    20000    5,000
17   67    23000    7,000
18   40    57000    9,000
19   53    62000   10,000

In [20]:
data['Income_M']=pd.to_numeric(data['Income_M'])

In [21]:
data['Income_M'].mean()

36600.0

In [25]:
data['Expenses']=data['Expenses'].str.replace(",","")
data['Expenses']=pd.to_numeric(data['Expenses'])

In [26]:
data['Expenses'].mean()

10925.0

In [27]:
data=pd.read_csv("Strings (1).csv")

In [28]:
data

    Age     Income_M Expenses
0    10   Rs 12000/-    8,000
1    30   Rs 45000/-   21,000
2    34   Rs 39000/-   20,000
3    16    Rs 6000/-    2,000
4    19   Rs 20000/-   10,000
5    45   Rs 42000/-    8,000
6    50   Rs 34000/-   10,000
7    43   Rs 56000/-   12,000
8    21   Rs 25000/-    7,000
9    78  Rs 100000/-   30,000
10   45   Rs 56000/-    6,000
11    9    Rs 2000/-      500
12   35   Rs 40000/-   12,000
13   49   Rs 27000/-   19,000
14   29   Rs 32000/-   10,000
15   96   Rs 34000/-   12,000
16   74   Rs 20000/-    5,000
17   67   Rs 23000/-    7,000
18   40   Rs 57000/-    9,000
19   53   Rs 62000/-   10,000

In [29]:
data['Income_M']=data['Income_M'].str.replace("Rs","").str.replace("/-","")

In [30]:
data['Income_M']=pd.to_numeric(data['Income_M'])